<template>
    <base-layout>
        <mu-appbar title="平台保证金协议条款" slot="header">
            <mu-icon-button icon="keyboard_arrow_left" slot="left" @click="onBack"/>
        </mu-appbar>

        <mu-content-block style="text-align:left">
            <p>消拼平台公司依据以下条件和条款为您提供所享有的服务，请仔细阅读并遵守</p>
            <p>欢迎阅读上海班若信息科技有限公司（消拼平台）服务条款协议（下称“本协议”）。本协议阐述之条款和条件适用于使用消拼平台网站（所涉及域名：www.xpin1.com）、微信服务号（消拼）所提供的在平台发布满减、满折信息活动的交易工具和服务（下称“服务”）。</p>
            <h2>一、接受条款</h2>
            <p>1.        本协议内容包括协议正文及所有消拼平台已经发布或将来可能发布的各类规则，所有规则为协议不可分割的一部分，与协议正文具有同等的法律效力。</p>
            <p>2.        以任何方式进入消拼平台并使用服务即表示已充分阅读、理解并接受本协议的条款和条件（以下合称“条款”）。</p>
            <p>3.        消拼平台有权根据业务需要酌情修订“条款”，并以网站公告的方式进行更新，不在单独通知。经修订的“条款”一经在消拼平台网站公布，即产生效力，如不同意相关修订，请立即停止使用“服务”，如继续使用“服务”，则将视为已接受修订的“条款”，当与消拼平台发生争议时，应以最新的条款为准。</p>
            <h2>二、注册</h2>
            <p>1.        服务使用对象</p>
            <p>企业、个体户依法取得营业执照且有实际经营场所的实体店商家（以下称“商户”）。</p>
            <p>2.        注册账户</p>
            <p>1)        按免费注册页面提示填写信息，阅读并同意本协议后，提交注册。注册成功后，凭用户名密码，登入消拼平台。</p>
            <p>2)        登入消拼平台后，按页面提示信息填写，提交资料，消拼平台初步审核无误后，代为提交申请微信支付服务商（消拼）的特约子商户。</p>
            <p>3)        特约子商户审核通过后，微信直接发送商户号和密码到注册时填写的邮箱，根据提示，完成验证、激活、授权。</p>
            <h2>三、账户安全</h2>
            <p>商户自行负责对消拼平台登录名和密码的保密，且须对该登录名和密码下发生的所有活动承担责任。</p>
            <h2>四、服务终止</h2>
            <p>1.        商户有权向消拼平台要求注销账户，经消拼平台审核通过后，将注销商户的账户。届时，商户与消拼平台基于本协议的合同关系终止。</p>
            <p>2.        商户与消拼平台的合同关系终止后：</p>
            <p>1)        消拼平台有权保存或删除商户的信息资料；</p>
            <p>2)        商户在使用平台服务期间存在违法行为、违反本协议条款的行为，消拼平台仍可依据本协议向商户主张权利。</p>
            <p>3)        商户在使用平台服务期间与用户之间发生的交易关系，不因本协议的终止而终止，用户仍有权向商户主张权利。</p>
            <h2>五、账户的注销</h2>
            <p>如商户的账户同时符合以下条件，商户的账户有可能被注销：</p>
            <p>1)        未绑定通过实名认证的账户；</p>
            <p>2)        连续6个月未登入过的；</p>
            <p>3)        不存在未到期有效业务的。</p>
            <h2>六、消拼平台的服务</h2>
            <p>1.        通过消拼平台提供的平台服务，商户可以平台上发布满减、满折等优惠活动促销信息和服务信息，获取用户交易并收款支付。参加消拼平台组织的活动以及使用其他信息服务及技术服务。</p>
            <p>2.        消拼平台仅作为商户发布信息的工具、促使用户达成交易、商户收款支付。平台不承担商户发布虚假、欺诈等信息造成的经济赔偿和法律后果，也不承担商户出售货物的质量、安全、合法等问题导致的纠纷赔偿。</p>
            <h2>七、服务使用规范</h2>
            <p>1.        商户对其填写、发布的信息资料（图片、文字等）负有全部责任，消拼平台仅作为商户发布信息的被动渠道。</p>
            <p>2.        商户同意并承诺：</p>
            <p>1)        不会发布含有虚假、欺诈成分的信息；</p>
            <p>2)        不会售卖盗窃和伪造的货物；</p>
            <p>3)        不会违反任何法律、法规或规章制度</p>
            <p>4)        不会违反本协议的条款规则。</p>
            <h2>八、交易规则</h2>
            <p>1.        商户发布满减或满折活动，只能二选其一，不能同时发布。消拼平台不对信息描述的准确性负责。</p>
            <p>2.        交易收款支付，用户参与活动交易后，直接付款到商户账户，不经平台转手。</p>
            <p>3.        商户不得操纵交易、不得干扰交易、不得恶意反馈。</p>
            <p>4.        关于消拼平台交易争议，商户根据用户提出的交易争议，持有相反意见的，应当及时提供相应的佐证给到用户进行协商，协商后仍无法处理的，申请平台介入。</p>
            <h2>九、违反交易规则</h2>
            <p>1.        若商户违反本协议和交易规则，消拼平台有权终止服务。</p>
            <p>2.        终止服务包括但不限于（暂停或注销商户账户、关停商户在消拼平台上的所有或者部分服务功能）。</p>
            <h2>十、争议解决</h2>
            <p>本协议签订地为上海市嘉定区，因本协议发生的争议，双方协商解决，协商不成的，诉请协议签订地的人民法院诉讼解决。</p>

        </mu-content-block>
    </base-layout>
</template>

<script>
    import BaseLayout from '../BaseLayout'
    import Mixin from '../../mixin'
    
    export default {
        mixins: [Mixin],

        components: {
            'base-layout': BaseLayout
        }
    }
</script>